-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: mysql
-- Время создания: Сен 13 2022 г., 16:10
-- Версия сервера: 8.0.21
-- Версия PHP: 7.4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `apelsinchiq`
--

--
-- Дамп данных таблицы `Routes`
--

INSERT INTO `Routes` (`id`, `number`, `departurePlace`, `arrivalPlace`, `departureTime`, `arrivalTime`, `trainId`, `places`, `price`) VALUES
(2, '1', 1, 2, '2022-05-19 13:19:20', '2022-05-20 16:19:20', 1, 140, 2500),
(3, '2', 2, 5, '2022-05-21 16:20:24', '2022-05-22 16:20:24', 2, 100, 3000),
(4, '3', 1, 5, '2022-05-19 17:26:49', '2022-05-23 17:26:49', 1, 50, 3000),
(5, '40', 1, 2, '2022-05-19 14:04:41', '2022-05-21 14:04:41', 2, 150, 1500),
(6, '5', 5, 1, '2022-06-03 13:03:58', '2022-06-05 14:03:59', 1, 20, 2700),
(9, '6', 5, 2, '2022-06-10 18:00:00', '2022-06-11 14:00:00', 2, 200, 3000),
(10, '7', 2, 1, '2022-06-14 10:00:00', '2022-06-15 09:00:00', 1, 180, 2800);

--
-- Дамп данных таблицы `SoldTickets`
--

INSERT INTO `SoldTickets` (`id`, `routeId`, `surname`) VALUES
(1, 2, ''),
(2, 3, ''),
(3, 3, ''),
(4, 3, ''),
(5, 3, ''),
(6, 3, ''),
(7, 3, ''),
(8, 3, ''),
(9, 3, ''),
(10, 3, ''),
(11, 6, 'Штанько'),
(12, 6, 'Фамилия'),
(13, 6, 'Фамилия'),
(14, 6, 'Фамилия'),
(15, 6, 'Фамилия'),
(16, 6, 'Фамилия'),
(17, 6, 'Фамилия'),
(18, 6, 'Фамилия'),
(19, 6, 'Фамилия'),
(20, 6, 'Фамилия'),
(21, 6, 'Фамилия'),
(22, 6, 'Фамилия'),
(23, 6, 'Фамилия'),
(24, 6, 'Фамилия'),
(25, 6, 'Фамилия'),
(26, 2, 'Штанько'),
(27, 5, 'Штанько'),
(28, 2, ''),
(29, 5, 'Симонова'),
(30, 2, 'Фамилия'),
(31, 2, 'Фамилия'),
(32, 2, 'Фамилия'),
(33, 2, 'Фамилия'),
(34, 2, 'Фамилия'),
(35, 5, 'Фамилия'),
(36, 9, 'Симонова'),
(37, 10, 'Романова');

--
-- Дамп данных таблицы `Stations`
--

INSERT INTO `Stations` (`id`, `name`) VALUES
(1, 'Волгоград-1'),
(2, 'Москва Павелецкая'),
(5, 'Казань');

--
-- Дамп данных таблицы `Trains`
--

INSERT INTO `Trains` (`id`, `number`, `company`) VALUES
(1, '001А', 'ФПК'),
(2, '002Б', 'СПК');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
